#include <stdio.h>


int main() {
    int t1, t2, t3;
    float total_time;

    // Зчитування вхідних даних
    printf("Введіть час для першого гостя (t1): ");
    scanf("%d", &t1);

    printf("Введіть час для другого гостя (t2): ");
    scanf("%d", &t2);

    printf("Введіть час для третього гостя (t3): ");
    scanf("%d", &t3);

    // Обчислення загального часу
    total_time = 1.0 / t1 + 1.0 / t2 + 1.0 / t3;

    // Виведення результату
    printf("Загальний час, за який гості можуть з'їсти пиріг: %.2f год\n", 1 / total_time);

    return 0;
}